<?php
namespace App\Libs;

class AppConstants {

    /********************************************
    /* 画面表示
    /********************************************
    /** 画面タイトル */
    const VIEW_TITLE = 'TF-CMS';

    /********************************************
    /* ロジックキー
    /********************************************
    /** メッセージ */
    const KEY_MSG = 'msg';
    /** エラーメッセージ */
    const KEY_ERR = 'error';
    /** ハッシュ sha256 */
    const HASH_KEY_SHA256 = 'sha256';

    /********************************************
    /* ルーティングディレクトリ
    /********************************************
    /** ユーザー認証 */
    const ROOT_DIR_AUTHS = 'auths';

    /********************************************
    /* エラーメッセージ
    /********************************************
    /** ログイン認証共通エラー */
    const ERR_MSG_AUTH = '入力エラーが発生しました。以下の項目を確認してください。';
}
